// en script begin
//#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ПрограммныйИнтерфейс

//Функция ВремяДокументаПоУмолчанию() Экспорт
//	
//	Возврат Новый Структура("Часы, Минуты", 20, 0);
//	
//КонецФункции

//#КонецОбласти

//#Область ПроцедурыИФункцииДляПечати

//// Заполняет список команд печати.
//// 
//// Параметры:
////   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
////
//Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
//	
//	
//	
//КонецПроцедуры

//#КонецОбласти

//#КонецЕсли
// en script end