// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьВидОперацииПоСтатье(СтатьяДоходовРасходов) Экспорт
	
	Если СтатьяДоходовРасходов = Справочники.СтатьиЗатрат.ВкладОтЗеленых Тогда
		Возврат Перечисления.уфВидыОперацийДвиженийДоходовИРасходов.ПередачаНаверхОтЗеленых;
		
	ИначеЕсли СтатьяДоходовРасходов = Справочники.СтатьиЗатрат.ВкладОтСиних Тогда
		Возврат Перечисления.уфВидыОперацийДвиженийДоходовИРасходов.ПередачаНаверхОтСиних;

	ИначеЕсли СтатьяДоходовРасходов = Справочники.СтатьиЗатрат.ВкладОтЖелтых Тогда
		Возврат Перечисления.уфВидыОперацийДвиженийДоходовИРасходов.ПередачаНаверхОтЖелтых;

	ИначеЕсли СтатьяДоходовРасходов = Справочники.СтатьиЗатрат.ВкладОтКрасных Тогда
		Возврат Перечисления.уфВидыОперацийДвиженийДоходовИРасходов.ПередачаНаверхОтКрасных;

	Иначе
		Возврат Перечисления.уфВидыОперацийДвиженийДоходовИРасходов.ПустаяСсылка();

	КонецЕсли;
	

КонецФункции // ПолучитьВидОперацииПоСтатье()

// Функция возвращает массив корректировочных значений перечисления
Функция ПолучитьВидыОперацийКорректировок() Экспорт
	
	МассивКорректировочныхЗначений = Новый Массив;
	
	МассивКорректировочныхЗначений.Добавить(Перечисления.уфВидыОперацийДвиженийДоходовИРасходов.ДоходыКорректировка);
	МассивКорректировочныхЗначений.Добавить(Перечисления.уфВидыОперацийДвиженийДоходовИРасходов.РасходыКорректировка);
	МассивКорректировочныхЗначений.Добавить(Перечисления.уфВидыОперацийДвиженийДоходовИРасходов.СчетаКорректировка);
	
	Возврат МассивКорректировочныхЗначений;
	
КонецФункции
